{"articles":[{"id":1,"title":"JavaScript Promises","content":"Don't make Promises you can't resolve!"},{"id":2,"title":"Just Harry Potter Things...","content":"Something something muggle. Something something hufflepuff."},{"id":3,"title":"Octopuses Punch Fish, Sometimes For No Apparent Reason","content":"\"You can see there some punches are almost like a small boop,\" Sampaio said. \"And the other ones that even the whole arm curls up and uncurls afterwards, you know, like the motion of a boxer doing a punch.\"\n\nThe punches are fairly rare, so it's not so easy to observe, he said. The research prompts many questions he said, like \"Is there a species that the octopus prefers to punch?\""},{"id":4,"title":"Rare 9-armed octopus found off Japan coast","content":"A nine-armed octopus caught off Japan's coast nearly ended up being dinner, until the family preparing it noticed its extra limb and sent it to a museum instead, according to news sources. \n\nWhile unusual, this extra appendage — which wasn't fully formed, but a small offshoot on a regular arm — isn't unheard of in octopuses, said Michael Vecchione, an invertebrate zoologist at the Smithsonian's National Museum of Natural History in Washington, D.C., who was not involved with this octopus's discovery.\n\nOctopuses are capable of regenerating their arms, but \"sometimes regeneration doesn't work quite right,\" Vecchione told Live Science. \"If an arm gets damaged, it might regenerate wrong; it could wind up with extra tissue growing out, and that extra tissue could turn into an arm.\""},{"id":5,"title":"CUTTLEFISH RISE TO THE OCCASION WHEN FACED WITH THE FAMOUS \"MARSHMALLOW TEST.\"","content":"Cuttlefish can be as good at controlling their urges as animals like chimpanzees, crows and parrots, researchers have said. \n\nIn a new study published Wednesday, scientists put six cuttlefish in conditions that would test whether they could delay gratification for a bigger reward.\n\nThe test was an underwater variant of what is commonly known as the marshmallow test, where participants can get a food reward straightaway, or hold out for something better like a marshmallow.\n\nThe cuttlefish were presented either with a piece of king shrimp or a more appealing live grass shrimp. "},{"id":6,"title":"'Unicorn' puppy has one ear in the middle of her head","content":"A golden retriever puppy in Michigan has been branded a \"unicorn\" due to an unusual facial feature: having only a single ear, positioned on the top of her head.\n\nRae - \"ear\" spelled backward - was brought to Family Friends Veterinary Hospital in Grand Rapids as a newborn because she required emergency surgery.\n\nThe now-12-week-old puppy is now in the care of Brianna Aardema, who was one of the people caring for Rae at the hospital.\n\n\"The minute I saw her, I knew I wanted to raise her and be there for her even though I knew the road to recovery wouldn't always be easy,\" Aardema told ABC's Good Morning America."},{"id":7,"title":"These sea slugs sever their own heads and regenerate new bodies","content":"Researchers discovered two species of sea slug that can grow bodies complete with a heart and other internal organs while observing them for other studies.\n\nOne of the creatures was seen moving around without its body on one occasion, and another was seen doing the same thing twice."},{"id":8,"title":"'One of a kind' puppy born with six legs and two tails - and it could be a big advantage","content":"It's believed that Skipper was supposed to have a twin, but they failed to completely split apart… meaning she has twice as many body parts from the waist down.\n\nAlthough she has just one head and chest, she's got two pelvic regions, two reproductive systems, and two tails.\n\nVeterinary specialists say they haven't been able to find any published case studies of a puppy being born alive with her congenital condition.\n\nSkipper was born in Oklahoma City on 16 February, and at a check-up 10 days later, she was described as \"strong and determined\"."},{"id":9,"title":"Baarack the Sheep Gets Sheared Of 78 Pounds Of Wool","content":"A wild and ailing sheep found in a forest in Australia, named Baarack by rescuers, has yielded a fleece weighing more than 78 pounds - nearly half the weight of an adult kangaroo - after being shorn for the first time in many a year."},{"id":10,"title":"test2","content":"this is a test"},{"id":11,"title":"test3","content":"new test"}]}