{"articles":[{"title":"Breaking: Books are portal to another dimension","url":"http://booksareportals.com","description":"woh","errors":[]},{"title":"'Next-gen' USPS vehicles can use gas or electric motors","url":"https://www.engadget.com/usps-next-generation-delivery-vehicle-230128191.html","description":"The vehicle will come in both combustion and electric powertrain variants.","errors":[]},{"title":"The remaining Fry's Electronics stores are all shutting down","url":"https://www.engadget.com/frys-electronics-closes-nationwide-055027690.html","description":"KRON4 confirmed reports that Fry's stores nationwide have closed their doors for the last time.","errors":[]},{"title":"Twitter bans 100 accounts linked to Russian troll farms","url":"https://www.engadget.com/twitter-bans-internet-research-agency-accounts-202823540.html","description":"The networks got caught up in a larger sweep involving 373 accounts.","errors":[]},{"title":"You are the frog in Peacock's upcoming 'Frogger' physical competition show","url":"https://www.engadget.com/frogger-competition-tv-show-peacock-194150547.html","description":"Remember Frogger? NBC sure hopes you do.","errors":[]},{"title":"States couldn't afford to wait for the FCC's broadband maps to improve. So they didn't","url":"https://www.cnet.com/features/states-couldnt-afford-to-wait-for-the-fccs-broadband-maps-to-improve-so-they-didnt/","description":"Georgia, Maine, Pennsylvania and others took mapping into their own hands, building their own granular data to pinpoint gaps in internet coverage and apply for federal funding.","errors":[]},{"title":" FCC readies rules for $50 emergency broadband subsidies","url":"https://www.cnet.com/news/fcc-readies-rules-for-50-emergency-broadband-subsidies/","description":"The agency considers a proposal to get the $3.2 billion COVID-19 relief fund up and running for people hit by the pandemic.","errors":[]},{"title":"iPhone 12 water test: Apple may be downplaying just how water-resistant it really is","url":"https://www.cnet.com/news/iphone-12-water-test-results-is-apple-downplaying-water-resistance/","description":"Apple's iPhone 12 put up a good fight after being submerged in the chilly waters of Lake Tahoe.","errors":[]},{"title":"Scientists stumble on a meteor smashing into Jupiter","url":"https://www.cnet.com/news/scientists-stumble-on-a-meteor-smashing-into-jupiter/","description":"Stare at this gas giant long enough and you'll eventually have a blast.","errors":[]},{"title":"Second Wave: Meet the 11 startups picked for Washington state’s maritime accelerator","url":"https://www.geekwire.com/2021/second-wave-meet-11-startups-picked-washington-states-maritime-accelerator/","description":"The maritime accelerator program first launched at the beginning of 2020 in partnership with WeWork Labs, the co-working company’s startup incubator.","errors":[]},{"title":"LinkedIn is down: ‘An error has occured’ (Update: Resolved)","url":"https://www.geekwire.com/2021/linkedin-error-occured/","description":"LinkedIn is back up. The company blames “a configuration change in our internal systems” for the outage.","errors":[]},{"title":"NASA releases jaw-dropping video and audio from Mars, with an assist from AWS","url":"https://www.geekwire.com/2021/nasa-releases-jaw-dropping-video-audio-mars-assist-aws/","description":"For the first time ever, NASA has captured video of a rover landing on the surface of Mars, plus audio of the wind whistling past it after the landing — and Amazon Web Services is playing a key role in making all those gigabytes of goodness available to the world.","errors":[]},{"title":"First Mode building hydrogen fuel cell to power one of the biggest zero-emission vehicles on Earth","url":"https://www.geekwire.com/2021/first-mode-building-hydrogen-fuel-cell-power-one-biggest-zero-emission-vehicles-earth/","description":"Seattle engineering company First Mode is building a hydrogen fuel cell generator capable of lighting up Lumen Field. But the technology is destined for an environment far from the bright lights of a football stadium.","errors":[]},{"title":"Here's why some McDonald's restaurants are putting cameras in their dumpsters","url":"https://www.cnn.com/2020/12/18/tech/compology-artificial-intelligence/index.html","description":"Jason Gates spends a lot of his time thinking about trash, and how we can generate less of it.","errors":[]},{"title":"This company is using drones to replant forests devastated by wildfires","url":"https://www.cnn.com/2020/12/03/tech/droneseed-wildfire-california-oregon/index.html","description":"The United States has had its most devastating wildfire season on record, with more than 8 million acres of land burned across the country this year.","errors":[]}]}